# GetCellCalculatedValue Method (Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..GetCellCalculatedValue Method (Int32)
TableSectionData Class See Also
---
Gets the calculated value for the specified column
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TableCellCalculatedValueData GetCellCalculatedValue(
	int nCol
)
```

Visual Basic
---
```text
Public Function GetCellCalculatedValue ( _
	nCol As Integer _
) As TableCellCalculatedValueData
```

Visual C++
---
```text
public:
TableCellCalculatedValueData^ GetCellCalculatedValue(
	int nCol
)
```

# ### Parameters
nCol
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. |

# See Also
TableSectionData Class
GetCellCalculatedValue Overload
Autodesk.Revit.DB Namespace